Revit 2027 API
ParameterTypeId.SteelElemHoleDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemHoleDiameter { get; }
Public Shared ReadOnly Property SteelElemHoleDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemHoleDiameter {
	ForgeTypeId^ get ();
}
static member SteelElemHoleDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace